In [1]:
import pandas as pd

employees = pd.DataFrame({
    "EmpID": [1, 2, 3],
    "Name": ["Alice", "Bob", "Charlie"],
    "DeptID": [10, 20, 30]
})

departments = pd.DataFrame({
    "DeptID": [10, 20, 40],
    "DeptName": ["HR", "Engineering", "Marketing"]
})

In [9]:
employees

   EmpID     Name  DeptID
0      1    Alice      10
1      2      Bob      20
2      3  Charlie      30

In [10]:
departments

   DeptID     DeptName
0      10           HR
1      20  Engineering
2      40    Marketing

In [12]:
pd.merge(employees,departments ,on="DeptID",how="left")

   EmpID     Name  DeptID     DeptName
0      1    Alice      10           HR
1      2      Bob      20  Engineering
2      3  Charlie      30          NaN

In [13]:
pd.merge(employees,departments ,on="DeptID",how="right")

   EmpID   Name  DeptID     DeptName
0    1.0  Alice      10           HR
1    2.0    Bob      20  Engineering
2    NaN    NaN      40    Marketing

In [14]:
pd.merge(employees, departments, on="DeptID", how="outer")

   EmpID     Name  DeptID     DeptName
0    1.0    Alice      10           HR
1    2.0      Bob      20  Engineering
2    3.0  Charlie      30          NaN
3    NaN      NaN      40    Marketing

In [23]:
df1 = pd.DataFrame({"Name": ["Alice", "Bob"] ,"score":[152,36]})
df2 = pd.DataFrame({"Name": ["Charlie", "David"] , "age":[53,75]})

pd.concat([df1, df2])

      Name  score   age
0    Alice  152.0   NaN
1      Bob   36.0   NaN
0  Charlie    NaN  53.0
1    David    NaN  75.0

In [24]:
pd.concat([df1, df2])

      Name  score   age
0    Alice  152.0   NaN
1      Bob   36.0   NaN
0  Charlie    NaN  53.0
1    David    NaN  75.0

In [25]:
pd.concat([df1, df2],axis=1)

    Name  score     Name  age
0  Alice    152  Charlie   53
1    Bob     36    David   75